[
    {
      "title": "How can I earn money with Superteam?",
      "body": "Superteam offers multiple ways to earn:\n\n1. Bounties (Quick Wins):\n- Short-term tasks worth ~$1,500 USDC\n- Includes coding, design, content creation\n- Competitive format with escrow payments\n- Best submissions win rewards\n\n2. Project Listings (Freelance):\n- Longer-term freelance opportunities\n- Direct work with Solana projects\n- Custom applications for specific roles\n- Selected applicant completes the work\n\n3. Hackathons & BuildStation:\n- Colosseum hackathons with $250K funding\n- BuildStation Demo Day with $10K prizes\n- Team formation for project building\n\n4. Event Contributions:\n- Talent Hub Friday recaps ($275 USDC)\n- Event organization and support\n- Community content creation\n\n5. Recruitment Bounties:\n- Colosseum Hackathon Recruiter ($2,100 USDC)\n- Bounty Hunter Recruiter ($250 USDC)\n- Help grow the ecosystem\n\nStart by following https://x.com/superteamIE for updates and joining t.me/superteamireland to connect with the community. Check earn.superteam.fun regularly for opportunities."
    },
    {
      "title": "What is BuildStation?",
      "body": "BuildStation is a two-week intensive build program hosted by Superteam IE in Dublin, designed to accelerate Solana projects for hackathons like Colosseum. It includes mentorship, workshops, and a Demo Day with $10K in prizes. The program is free for selected participants and culminates in live project pitches to judges and investors."
    },
    {
      "title": "What happens at BuildStation?",
      "body": "BuildStation includes:\n- Week 1: Project syncs, dev support, pitching skills, deck reviews\n- Week 2: Fundraising, legal guidance, design feedback, Demo Day prep\n- Daily: Mentor sessions, ecosystem calls, group dinners, co-working\n- Finale: Demo Day with 3-minute pitches and $10K in prizes"
    },
    {
      "title": "How do I join BuildStation?",
      "body": "Watch @superteamIE on X for cohort announcements and applications. Selected participants get access to the full program, including mentorship, dev support, meals, and Demo Day. Spaces are limited, so express interest early when applications open."
    },
    {
      "title": "What can I gain from BuildStation?",
      "body": "Benefits include:\n- Ship Solana projects with ecosystem-ready features\n- Learn pitching, fundraising, and compliance\n- Network with judges, mentors, and investors\n- Compete for $10K in prizes and $250K Colosseum funding\n- Join Ireland's Solana builder community"
    },
    {
      "title": "What is Talent Hub Friday?",
      "body": "Talent Hub Friday is a weekly or bi-weekly event hosted by Superteam IE in Ireland at Dogpatch Labs in Dublin. It brings together developers, designers, creators, and newcomers for workshops, mentorship, co-working, and networking to build Solana projects. It's free to attend (including lunch and coffee) but registration via LumaHQ is required."
    },
    {
      "title": "What happens at Talent Hub Friday?",
      "body": "Talent Hub Friday includes:\n- Morning: Coffee, newbie onboarding, and Solana introductions\n- Midday: Workshops/guest speakers (UI/UX, AI, funding, etc.)\n- Afternoon: Co-working, networking, hackathon team-matching\n- Free lunch and coffee provided\nSessions vary weekly - check @superteamIE for the latest agenda."
    },
    {
      "title": "How do I register for Talent Hub Friday?",
      "body": "Register via the LumaHQ link shared in @superteamIE's weekly X posts. Spaces are limited, so RSVP early. Follow @superteamIE for registration updates. The event is free but registration is required to secure your spot."
    },
    {
      "title": "What can I gain from Talent Hub Friday?",
      "body": "Benefits include:\n- Skills: Learn Solana development, UI/UX, AI integration\n- Connections: Join Ireland's Solana community and meet builders\n- Opportunities: Access bounties and collaborate with startups\n- Ecosystem Access: Get mentorship and resources for projects"
    },
    {
      "title": "What if I'm new to Solana?",
      "body": "Talent Hub Friday welcomes beginners with dedicated onboarding sessions to introduce Solana and Web3 concepts. You'll get hands-on guidance, resources, and connections to start your journey in the ecosystem."
    },
    {
      "title": "What is Superteam Ireland?",
      "body": "Superteam Ireland is a grassroots accelerator initiative backed by the Solana Foundation, launched in April 2025, aimed at fostering Web3 innovation across Ireland. It's part of a global network focused on empowering builders, developers, and creators in the Solana ecosystem."
    },
    {
      "title": "When was Superteam Ireland launched?",
      "body": "Superteam Ireland was launched in April 2025."
    },
    {
      "title": "What are Superteam Ireland's key objectives?",
      "body": "Superteam Ireland's key objectives include:\n- Supporting Web3 developers and entrepreneurs.\n- Leveraging Ireland’s developer density to position the country as a global Web3 hub.\n- Fostering real-world blockchain applications (DeFi, pharma, biotech, health sciences).\n- Promoting diversity, inclusion, and cross-disciplinary collaboration.\n- Growing Irish talent and connecting builders with opportunities.\n- Making Ireland a strong node in the global Solana network."
    },
    {
      "title": "Where does Superteam Ireland primarily operate from?",
      "body": "Superteam Ireland operates primarily out of Dogpatch Labs in Dublin, hosting weekly meetups and events."
    },
    {
      "title": "Who leads Superteam Ireland?",
      "body": "Alejandro Gutierrez leads Superteam Ireland and is also the Director of Blockchain Ireland. He is a key figure in driving the initiative’s vision."
    },
    {
      "title": "How is Superteam Ireland structured within the global Superteam network?",
      "body": "Superteam Ireland operates as part of the global Superteam network, which functions as a 'collective of sovereigns' and is known as the 'Talent Layer of Solana.' It connects talent with projects through platforms like Superteam Earn. Local chapters have autonomy to pursue specific, localized strategic objectives."
    },
    {
      "title": "What types of events does Superteam Ireland host?",
      "body": "Superteam Ireland hosts a variety of events, including hackathons, meetups, collaborative workspaces, student outreach initiatives, and high-level networking events."
    },
    {
      "title": "What was the Dublin BuildStation?",
      "body": "The Dublin BuildStation was a collaborative workspace event held prior to May 2025 that supported 19 project submissions to the Solana Colosseum Hackathon. It helped founders and developers refine projects in areas like stablecoin payments, agentic AI, and health tech."
    },
    {
      "title": "What was the Solana Superteam Ireland Breakout Hackathon?",
      "body": "The Solana Superteam Ireland Breakout Hackathon was an event organized by Superteam Ireland in May 2025 where participants developed innovative projects on the Solana blockchain. The project FundRaisely won 5th place."
    },
    {
      "title": "What was the Dublin Startup Village?",
      "body": "The Dublin Startup Village was a pop-up coworking event hosted by Superteam Ireland, backed by the Solana Foundation and Solana Labs, held from June 9–18, 2025. It brought together founders and builders working on Solana, AI, and Web3."
    },
    {
      "title": "What was CryptoMondays Ireland with ETHDublin, Solana Superteam Ireland & Techstars?",
      "body": "This was a collaborative networking event held on May 26, 2025, as part of Dublin Tech Week (May 23–30, 2025). It focused on discussing Web3 trends and strengthened ties between different blockchain communities in Ireland."
    },
    {
      "title": "What are Solana Superteam Campus Builders events?",
      "body": "These are meetups explicitly designed to target students from all Irish universities. They include networking, presentations, and hands-on 'builder sessions.' The next one is scheduled for Thu, Sep 11, 2025, at 12:30 PM in Dublin."
    },
    {
      "title": "What is the Payments Innovation Roundtable?",
      "body": "The Payments Innovation Roundtable is an upcoming discussion event scheduled for Wed, Sep 17, 2025, in Dublin. It will focus on themes shaping on-chain finance, including stablecoins and tokenized securities."
    },
    {
      "title": "What is the upcoming CryptoMondays Ireland in Belfast?",
      "body": "An upcoming CryptoMondays Ireland event is planned for Mon, Sep 22, 2025, in Belfast. This signals Superteam Ireland's strategic geographic expansion beyond Dublin."
    },
    {
      "title": "What upcoming events are generally planned?",
      "body": "Superteam Ireland is planning further events, including university engagement initiatives and additional hackathons. Specific details are continually announced on their social channels."
    },
    {
      "title": "What are bounties and the Superteam Earn platform?",
      "body": "Bounties are short-term tasks designed to engage skilled professionals in the Solana ecosystem, typically around 1,500 USDC. Superteam Earn (earn.superteam.fun) is a digital marketplace for these bounties and freelance gigs, allowing members to build 'proof of work.'"
    },
    {
      "title": "What is the 'Build a Superteam Ireland Telegram Chatbot' bounty?",
      "body": "This bounty offers 500 USDC to create a Telegram bot for the Superteam Ireland group and DMs. The bot must answer FAQs, display upcoming events, list current bounties, notify users of new bounties, and use commands like /help, /faq, /events, and /bounties."
    },
    {
      "title": "What is the 'Create a System to Onboard University Students to Superteam Ireland' bounty?",
      "body": "This bounty offers 1,500 USDC total (500 USDC each for 1st, 2nd, and 3rd place) to design and implement a system to attract Irish university students to Superteam Ireland, aiming for at least 5 new student members."
    },
    {
      "title": "What is the 'Write a Talent Hub Recap' bounty?",
      "body": "This bounty rewards $275 USDC for writing a recap for LinkedIn and X, serving as a strategic investment in marketing and community documentation."
    },
    {
      "title": "What is the 'Create a University Solana Society' bounty?",
      "body": "This bounty offers $1,000 USDC for establishing a Solana society on a university campus, a direct investment in long-term talent pipeline development."
    },
    {
      "title": "What is the 'Deep Dive: The Impact of Stablecoins on Ireland's Payments Industry' bounty?",
      "body": "Worth $500 USDC, this bounty is for research on the impact of stablecoins on Ireland's payments industry, aimed at attracting institutional attention and building credibility."
    },
    {
      "title": "What are the 'Colosseum Hackathon Recruiter' and 'Bounty Hunter Recruiter' bounties?",
      "body": "These two bounties offer $2,100 USDC and $250 USDC, respectively, for recruiting new talent to the ecosystem. They are direct investments in talent acquisition and growth."
    },
    {
      "title": "Who are Superteam Ireland's main partners?",
      "body": "Superteam Ireland collaborates with the Solana Foundation, Solana Labs, Dogpatch Labs, ETHDublin, Techstars, Fehur, Blockchain Ireland, Norio Ventures, and Little Unusual."
    },
    {
      "title": "What is Superteam Ireland's relationship with the Solana Foundation and Solana Labs?",
      "body": "Superteam Ireland is directly backed by the Solana Foundation, providing funding and strategic support. Solana Labs also supports events. The Foundation is a core grant partner, and Superteam Ireland acts as its regional extension."
    },
    {
      "title": "What is Dogpatch Labs' role in Superteam Ireland?",
      "body": "Dogpatch Labs in Dublin serves as Superteam Ireland's primary hub, providing physical space and supporting community growth. It hosts weekly Talent Hub Fridays and other events."
    },
    {
      "title": "How does Superteam Ireland collaborate with ETHDublin?",
      "body": "Superteam Ireland collaborates with ETHDublin for events like CryptoMondays Ireland during Dublin Tech Week, fostering cross-community networking between Solana and Ethereum communities."
    },
    {
      "title": "What is Techstars' involvement with Superteam Ireland?",
      "body": "Techstars partners with Superteam Ireland for events, strengthening ties with the startup ecosystem and providing access to networks and expertise."
    },
    {
      "title": "Who is Fehur and how do they collaborate with Superteam Ireland?",
      "body": "Fehur is a human-first AI-powered financial wellness platform that participated in the Dublin Startup Village, integrating Solana’s Web3 infrastructure. This highlights Superteam Ireland’s role in supporting innovative startups."
    },
    {
      "title": "What is Superteam Ireland's relationship with Blockchain Ireland?",
      "body": "Alejandro Gutierrez, lead of Superteam Ireland, is also the Director of Blockchain Ireland, aligning the organizations. Blockchain Ireland supports Superteam’s mission through events like the Blockchain Ireland Summit 2025."
    },
    {
      "title": "What is Superteam Ireland's relationship with Norio Ventures?",
      "body": "Superteam Ireland deeply collaborates with Norio Ventures to 'scale Solana in Ireland' and 'connect founders with traditional investors,' bridging Web3 projects with institutional funding."
    },
    {
      "title": "What is Superteam Ireland's relationship with Little Unusual?",
      "body": "Little Unusual is a website and project partner, collaborating on initiatives like 'Super Tokyo Promo,' indicating a focus on creative and promotional projects."
    },
    {
      "title": "How can I engage with the Superteam Ireland community online?",
      "body": "You can engage via their Telegram group (search via @SuperteamIE or superteam.fun), LinkedIn page, X account (@SuperteamIE), and YouTube channel (@SuperteamIE)."
    },
    {
      "title": "What recent results and impact has Superteam Ireland achieved?",
      "body": "Recent impacts include: 19 project submissions to Solana Colosseum Hackathon (May 2025), FundRaisely winning 5th place at a hackathon, capitalizing on Ireland’s high developer-per-capita rate, and significant community growth through events."
    },
    {
      "title": "What are Superteam Ireland's future plans?",
      "body": "Future plans include: expanding geographic reach (e.g., Belfast), deepening strategic focus on connecting with investors and researching stablecoins, increasing university engagement, expanding Dublin Startup Village events, and focusing on emerging verticals (payments, AI, healthcare)."
    },
    {
      "title": "What are the steps to join Superteam Ireland and the Superteam network?",
      "body": "You can join through three progressive tiers: Lurker (Level 1), Contributor (Level 2), and Member (Level 3)."
    },
    {
      "title": "How can I start as a Lurker (Level 1)?",
      "body": "To become a Lurker:\n- Join the Telegram Group (@SuperteamIE or superteam.fun).\n- Follow @SuperteamIE on X.\n- Attend weekly Talent Hub Fridays at Dogpatch Labs.\n- Join the Global Superteam Discord (superteam.fun).\nBenefits include basic community access and updates on opportunities."
    },
    {
      "title": "How can I become a Contributor (Level 2)?",
      "body": "To become a Contributor:\n- Complete Bounties on Superteam Earn (earn.superteam.fun).\n- Introduce Sponsors.\n- Engage on Solana Stack Exchange to earn XP.\n- Get Vouched For by a Superteam Member with over 1,000 XP.\n- Join the Superteam Talent Network (talent.superteam.fun).\nBenefits include partial Discord access and opportunities for exclusive projects/grants."
    },
    {
      "title": "How can I advance to Member (Level 3)?",
      "body": "To advance to Member:\n- Consistently add value through bounties, projects, or hackathons.\n- Win eligible opportunities.\n- Engage actively at events and in discussions.\n- Demonstrate leadership by mentoring or organizing.\nBenefits include full Discord access, exclusive events, ability to invite Contributors, and visibility."
    },
    {
      "title": "How can I engage with Superteam Ireland's local ecosystem?",
      "body": "Engage locally by:\n- Attending Talent Hub Fridays.\n- Participating in Hackathons and BuildStations.\n- Joining the Dublin Startup Village.\n- Networking with partners like Dogpatch Labs, ETHDublin, or Blockchain Ireland."
    },
    {
      "title": "How can I leverage the Superteam Talent Network for jobs?",
      "body": "Leverage the Talent Network by:\n- Signing up at talent.superteam.fun to access Solana ecosystem job opportunities.\n- Applying for roles in development, design, or marketing.\n- Becoming a Scout to refer talent and earn rewards."
    }
  ]